Santroller/Santroller/src/pico/pins_arduino.h
#pragma once
#define NUM_DIGITAL_PINS 26
#define NUM_ANALOG_INPUTS 3
#define PIN_WIRE_SDA 0
#define PIN_WIRE_SCL 1
#define PIN_SPI_MOSI 3
#define PIN_SPI_MISO 4
#define PIN_SPI_SS 5
#define PIN_SPI_SCK 6
#define PIN_RF_IRQ 7
#define PIN_A0 26
#define PIN_A1 27
#define PIN_A2 28
#define PIN_WAKEUP 8
// RF pins
#define CE 8
#define CSN PIN_SPI_SS